{
  "users": {
    "_model": "User",
    "homer": {
      "firstName": "Homer",
      "lastName": "Simpson",
      "email": "homer@simpson.com",
      "password": "secret",
      "admin": true
    },
    "marge": {
      "firstName": "Marge",
      "lastName": "Simpson",
      "email": "marge@simpson.com",
      "password": "secret"
    },
    "bart": {
      "firstName": "Bart",
      "lastName": "Simpson",
      "email": "bart@simpson.com",
      "password": "secret"
    }
  },
  "Category": {
    "_model": "Category",
    "NorthEast": {
      "name": "The North East"
    },
    "East": {
      "name": "The East Coast"
    },
    "West": {
      "name": "The West"
    },
    "South": {
      "name": "The South"
    }
  },
  "pois": {
    "_model": "Poi",
    "ColtIsland": {
      "name": "Colt Island",
      "description": "<p><strong>Colt Island</strong> O267-611          Sheet 43 A small, low-lying island lying just off the point at Skerries. Land easily on sand/shingle on SW side. The E side has reefs and breakers that should be avoided in strong NE – SE winds in spring ebb tides.</p>\n",
      "category": "->Category.East",
      "geo": {
        "lat": "53.5846497",
        "long": -6.08758199
      },
      "image": "https://res.cloudinary.com/dgr3huhwp/image/upload/v1551021605/sample.jpg"
    },
    "SaintPatricksIsland": {
      "name": "Saint Patrick’s Island",
      "description": "<p><strong>Saint Patrick’s Island</strong> O276-613          Sheet 43 A small island, outside Colt, known locally as Church Island. The accuracy as to whether St. Patrick ever landed here is a source of some debate. This is the jumping off point for Rockabill. Land easily at a sheltered storm beach, just W of the S tip, in almost any conditions. Landing is also possible at higher tides at a shingle cove just further E. There is a further landing place on the N facing shore near a ruined house and marked by two metal poles – a small beachlet among the rocks, for when southerlies prevail. There is the ruin of an Early Christian Church and a small monastery, which dates back to Viking times. It was important enough to merit a synod being held in 1148 in which fifteen bishops, two hundred priests, and several other clergy assisted. The church towards the E tip is still very much worth the visit. St Patrick’s Island has an internationally important breeding population of Cormorants (2001 Census) of 550 pairs. There are breeding gulls, Shags and Fulmars in summer, while geese, ducks and waders provide winter interest. There is a colony of 70-80 Grey Seals, especially during winter. The NE and eastern sides of the island catch the full ebb tide over a rocky underwater reef. Overfalls can develop, especially in S/SE winds against a spring ebb tide. In the sound between St. Patrick’s and Colt Islands, a lesser overfall can develop over a small bar that extends westwards off the corner of St. Patrick’s.</p>\n",
      "category": "->Category.East",
      "geo": {
        "lat": "53.58622764",
        "long": -6.0739187
      },
      "image": "https://res.cloudinary.com/dgr3huhwp/image/upload/v1551021605/sample.jpg"
    },
    "BlockhouseIsland": {
      "name": "Blockhouse Island",
      "description": "<p><strong>Blockhouse Island</strong> J255-096           Sheet 29 Blockhouse Island (a guano pile in springtime) lies between Sheep Rock and Haulbowline Lighthouse, is bigger than either but is not named on the OS map. This small rocky islet guards the entrance to Carlingford Lough. A military building was erected here in 1602, now entirely ruined, and was known as Carlingford Fort. The island is small and worthwhile mainly as a waypoint on tour, as landing may always be had onto stormbeaches on the W or slabby limestone on the E side. The lighthouse just to the E at J260-096 is 20m high with a white light flashing three times every ten seconds and an ancillary red light lower down continuously flashing. Landing at the lighthouse is not permitted and anyway can only be achieved in calm conditions. The main channel into the lough passes to the N of the island, where one must avoid commercial shipping. Navigation in the lough is very buoyage orientated so consider using Chart 2800. Embark on the S side of the lough from Greenore or from the pretty Carlingford Harbour. The best launching in Greenore is from behind the pier at J225-107, and in Carlingford launch just outside the E pier at J194-118, as the silted harbour exposes black mud at the bottom of the tide. On the Northern Ireland side, launch from Greencastle Point at J242-117, or a small car park and beach at J263-107, between Soldiers Point and Cranfield Point. Tides Tides run strongly in the lough entrance near the island, where the ebb and flow start with local HW and LW, which are much the same as Dublin, especially in the dredged channels E &amp; N of the island, where 5kn can be experienced.  On the other hand, on-shore winds on the ebb throw up a fearsome sea state. The ebb tide runs at 3.5<em>kn</em> in springs in the dredged channels. The flow follows the main dredged channels except for an eddy on the flood on the E side of Blockhouse Island. Good overfalls and races occur during both the flood and the ebb around the Haulbowline Lighthouse. The most pleasant and relatively safe playing in these overfalls is on the flood tide. The area is regularly used by local clubs and centres for rough water training. <strong>The East Coast</strong> <strong>Greenore Point to Carnsore Point</strong> <strong>County Dublin</strong> <strong>Islands off Skerries</strong> A group of three low-lying islands lie just off the coast at Skerries, with ‘The Rock’ further off. Taken together they form an interesting day trip with good wildlife interest. They are listed as areas of Scientific Interest by Duchás with SPA status. Camping is possible, but no water is available. The presence of a healthy population of rats on the inner islands may discourage an overnight. Rugged Rockabill further out is a lighthouse island rock. SPA Short-eared Owl (up to 7 in winter), Golden Plover, and Common, Sandwich and Roseate Tern. Embarkation The most convenient embarkation place is at the slipway beside the RNLI building at the pier in Skerries, where parking is generally convenient at O255-612, but not for larger groups especially in summer. Otherwise its Pay&amp;Display or search.  Do not, under any circumstances, block the access to or interfere with the operation of the lifeboat station, or of the working pier. Launching may also be had less conveniently from the E facing South Strand, but only at HW to avoid a long carry. The main catch at Skerries is prawn and shrimp. Accordingly, the local fishermen are benignly disposed to seals, which do not catch either. Seals are plentiful hereabouts. Tides The flows flood generally north and ebb south. Tides flow strongly in the sounds.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Among Inner Islands</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\"><strong>Direction</strong></td>\n\n<td width=\"173\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">N</td>\n\n<td width=\"173\">4:30 after Dublin HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"78\">S</td>\n\n<td width=\"173\">1:30 before Dublin HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The cycle starts and finishes about 10 minutes later at neaps at -1:20 and +4:20. The speed does not take into account local anomalies. Certainly the speed of the ebb tide on the northeastern side of St. Patrick’s Island are greater than stated due to some of the ebb flow being deflected eastwards from the inner bay. The speed and sea state are also increased by a rock shelf of the northeastern corner. The speed over Dithaun spit which runs west from St. Patrick’s Island is similarly higher but only for 1-1:30 hours after HW.</p>\n<table>\n\n<tbody>\n\n<tr>\n\n<td colspan=\"3\" width=\"308\"><strong>Between St. Patrick’s &amp; Rockabill</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\"><strong>Direction</strong></td>\n\n<td width=\"170\"><strong>Time</strong></td>\n\n<td width=\"57\"><strong>Speed</strong></td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">N</td>\n\n<td width=\"170\">5:30 after Dublin HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n<tr>\n\n<td width=\"81\">S</td>\n\n<td width=\"170\">0:30 before Dublin HW</td>\n\n<td width=\"57\">2kn</td>\n\n</tr>\n\n</tbody>\n\n</table>\n\n<p>The cycle starts and finishes about 10 minutes later at neaps at 0:20 before and 5:20 after Dublin HW. Shallow areas to the east of St. Patrick’s and Shenick can speed up the flow locally. Local HW/LW is 20 minutes before Dublin.</p>\n",
      "category": "->Category.NorthEast",
      "geo": {
        "lat": "54.02043588",
        "long": -6.08594502
      },
      "image": "https://res.cloudinary.com/dgr3huhwp/image/upload/v1551021605/sample.jpg"
    },
    "gunsIsland": {
      "name": "Guns Island",
      "description": "<p><strong>Guns Island</strong> J596-415           Sheet 21 Guns Island lies 2<em>km</em> S of the entrance to Strangford Lough. At extreme LW springs, it is possible to walk or wade across to the island from the beach at Ballyhornan. What looks suspiciously like an active sewage outlet pours into the sea just S of the village. Most of the time, a reasonably strong tide runs between Guns Island and the mainland – up to 2<em>kn</em>. Landing is always possible on one side or the other of the sandy spit stretching NW of the island. At LW, or in search of shelter, landings may be had elsewhere in small coves, particularly halfway down the W side. There is a lovely old stone navigation marker painted white on the SE tip. Beside it lies the remains of an old ruined church. Thick grass covers the island. Very attractive spot. Fauna The SE side of Guns Island is a mass of nesting Kittiwake, Guillemot and Cormorant on the cliff ledges and paddlers should keep a reasonable distance offshore to avoid disturbance during the nesting season (April-June). The N side is favoured by a large colony of gulls that nest on the tussock grass just above the shore. <strong>Strangford Lough to Carlingford Lough</strong> Sheet 21/Sheet 29 Killard Point at J613-435, a National Nature Reserve, is well worth a visit, especially in June to see the abundance of butterflies and wild flowers growing on the sand dunes. Among these can be found the beautiful Bee Orchid, Spotted Orchid, Wild Thyme and Yellow Rattle. Butterflies include the Common Blue, Small Heath and Meadow Brown. The 14<em>km</em> from the entrance of Strangford Lough to St.John’s Point is a lovely paddle along small cliffs and a rocky shore of siltstones and shales believed to be formed during the Silurian period, 435 million years ago. This area is known as the Lecale and shortly after the last ice age would have been a large island with the sea connecting Dundrum inner bay with Strangford Lough. Banderg Bay at J605-432 followed by Ballyhornan Bay at J594-420, are pleasant sandy beaches with clay cliffs behind, where there are nesting Fulmar. Never disturb these birds at their nest as they have the ability to douse you with an extremely evil smelling mucus from their nostrils which sticks better than any glue known to man! Portnacoo at J589-406, 200m SW of the southern tip of Guns Island, has a 2m wide gap in the rocks which opens out into a cove with a 15m wide pebbly peach, an ideal lunch stop. At Legnaboe, on the mainland about 600<em>m</em> S of the southern tip of Guns Island, there is a narrow sea cave which appears safe to enter at all states of the tide, provided there is little swell. Along this piece of coast lie the villages of Ardglass at J563-373 and Killough at J540-363. Although Killough was an important fishing port, the harbour is now derelict, whilst Ardglass has taken over as a principal fishing port, famous for its herrings, pronounced locally as ‘hearns’. A new marina has been built at Ardglass and there is easy access to the sea from both Killough and Ardglass with a good slip and carparking on the harbour at Ardglass. SPA Brent Goose (Killough Harbour) From St. John’s Point at J526-333 to Newcastle (a distance of 15<em>km</em> as the crow flies or as the canoeist paddles), the scenery is dominated by the beach and sand dune systems of Murlough National Nature Reserve (NNR). Within the inner bay at Dundrum, there is a causeway and bridge at J402-356. This connects the farms and houses within Murlough NNR to the main Dundrum to Newcastle road. The tide flows through this bridge at up to 6<em>kn</em> on springs in its rush to fill or empty the southern half of the inner bay. Good eddies are created by the bridge stanchion and this is used almost constantly at HW by local paddlers to teach and practise moving water techniques. HW at the bridge is +0030 HW Dover. The best fun is to be had during springs. This occurs every second weekend when the tide is usable from approx. 1000hrs until 1500hrs, HW being around midday. During the ebb from Dundrum inner bay, tremendous deep water surfing waves can be formed at the entrance if there is even a little swell from the S or E. However, once the tide has finished ebbing, the only practical course of action is to paddle to Newcastle 5<em>km</em> away as the inner bay will be dry. For 2<em>km</em> to the S and 3<em>km</em> to the N of the entrance to Dundrum inner bay, care must be taken due to the rifle range at the army camp at Ballykinler. There are 3 yellow marker buoys marked DZ and the paddler should keep to the seaward side of these when the red flag (day) or red lights (night) are visible over the base just N of the entrance to the inner bay. However, tracers have been sighted by local canoeists doing a night paddle from St.John’s Point to Newcastle that would indicate that they could travel more than 2<em>km</em> beyond these buoys. The Coastguard should be contacted before paddling this section of coast. The tides along this section of coast to St.John’s Point are weak. A trip from St.John’s Point to Newcastle is a very popular paddle on a good moonlit night as you have the lighthouse flashing behind you, the twinkling lights of Newcastle to aim for and the foreboding outline of the Mournes dominating the paddle. Newcastle is very much the seaside holiday tourist town and is usually thronged between Easter and September, especially at weekends. However, good access to the beach exists from various car parks in the town. Access is also available from the harbour where there is very limited parking. It should be noted that this dries out at low water. Access may still be gained over the wall to the stony beach to the S of the harbour at J382-296. A sewage outfall pipe lies about 1 cable offshore to the S of the harbour and, although Newcastle’s sewage works are meant to be one of the most sophisticated in the UK, the area surrounding the pipe should be well avoided! During S or E winds, good surfing can be had at the beach and a good break exists at the mouth of the harbour at lower water. During particularly strong winds, i.e. above Force 6, the surf is very broken and you can find yourself 500m offshore still looking for a way out through the soup. Having said that, this must be one of the most picturesque places to surf – ‘Where the Mountains of Mourne sweep down to the sea’. The scenery of the Mourne Mountains dominates the 25<em>km</em> from Newcastle to Cranfield Point at J270-099 on the northern side of the entrance of Carlingford Lough. It is made up of rocky beaches and small cliffs, a relic from the ice age that shaped the panorama of the Mourne scenery more than 10,000 years ago. From Newcastle to Bloody Bridge at J389-269, the coastline is interesting. The small cliff scenery provides enjoyable rock dodging, particularly at high water, when many of the caves and channels become more accessible. The National Trust owns the section of coast between Bloody Bridge and the mouth of the Crock Horn Stream below Ballagh Bridge, 2<em>km</em> S at J388-249. After that, there is good access to the sea at Glassdrumman Port at J381-222, famous with geographers for the obvious series of easily identified raised beaches and a very pleasant little sandy beach from which to launch or enjoy your lunch. There are a number of small but enjoyable caves in the area, one of which has a blowhole at the top. There are also two bigger caves, one of which involves a 50<em>m</em> squeeze, where hands are needed to get through. This cave is not obvious from the sea but it can be found with careful exploring and it’s worth going through, especially in a plastic boat! The other large cave has a small rocky beach at the back and if there isn’t much swell, it’s good fun landing and exploring on up the cave. A short trip from Newcastle to Bloody Bridge and back is ideal for introducing novices to spectacular sea canoeing. The next principal port is Annalong which has a small harbour at J378-197, used mainly by small craft engaged in creeling (laying lobster pots). Further along the coast is a small rock called Selk Island at J359-176, which appropriately enough has a small colony of Common Seal. Then, passing Lee Stone Point at J334-144, the large granite boulder (another relic of the ice age known as an erratic) is an obvious feature. The fishing port of Kilkeel lies 6<em>km</em> short of Cranfield Point. This is one of Northern Ireland’s busiest fishing ports with up to 70 boats using the harbour at J317-140. <strong>County Louth</strong> <strong>Carlingford Lough</strong> Carlingford Lough is the most dramatic sea lough on the E coast of Ireland, almost a fiord, with the Mourne Mountains to the N and the craggy Carlingford Mountains to the S. It has great variation, from pleasant, sheltered paddling within the lough to big races and overfalls at its mouth. The S side of the lough is in the Republic of Ireland while the N side is in Northern Ireland. Up until (reputedly) the 1950’s, a lucrative smuggling trade ran between Greencastle and Carlingford harbours. The tidal streams within the lough are weak and a pleasant and undemanding crossing can be made from Killowen or Rostrevor Quays to Carlingford village. However, during strong WNW winds, squalls funnel down from the hills around Rostrevor and cause little cyclones and mini tornadoes on the surface. These are known locally as ‘Kettles’ as the water appears to boil and steam to rise. The Newry Canal can be accessed on the S side of the lough beyond Warrenpoint at J108-207. This is really only practicable during HW as the area surrounding the access to the canal dries to extensive mudflats. There are reports that the canal is going to be reopened. The canal goes to Lough Neagh but a passage, even by canoe, is exceptionally difficult, as it is heavily overgrown and silted. SPA Common and Sandwich Tern, Brent Goose</p>\n",
      "category": "->Category.NorthEast",
      "geo": {
        "lat": "54.29735434",
        "long": -5.54925954
      },
      "image": "https://res.cloudinary.com/dgr3huhwp/image/upload/v1551021605/sample.jpg"
    }
  }
}
